# Найдите сумму цифр трехзначного числа : 123 --> 6 (1+2+3)
a = int(input('Введите  число: '))
while not 99 < a < 1000 :
    a = int (input('Введите 3-ое число: '))

a1 = a
summa = 0 

while a > 0 :
    ost = a % 10
    summa += ost
    a //= 10

print (f'Сумма всех чисел в числе "{a1}" --> {summa}')



     